app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `body`, `publish_at`, `created_at`, `updated_at`) VALUES ('test', 'abc', '2021-12-15 03:32:00', '2021-12-15 03:49:26.226165', '2021-12-15 03:49:26.226165')
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE `posts` SET `posts`.`publish_at` = '2021-12-15 06:13:00', `posts`.`updated_at` = '2021-12-15 06:13:22.818161' WHERE `posts`.`id` = 19
---
  def update
    respond_to do |format|
      if @post.update(post_params)